package uni;

import java.util.Random;

public class Chance {

    public static void BadGood() {

        if (Dice.RollDice(10) > 5) {
            System.out.println("You have good luck today!");
            GoodChance();
        } else {
            System.out.println("You have bad luck today!");
            BadChance();
        }
    }

    public static void BadChance() {
        int a = Dice.RollDice(100);
        if (a < 40) {
            System.out.println("Вдигате толкова голям купон, че\n" +
                    "не знаете къде се намирате на\n" +
                    "следващата седмица. С мъка\n" +
                    "установявате, че телевизорът Ви е\n" +
                    "откраднат. Губите 50 парички.");
        }
        if (a > 39 && a <66) {
            System.out.println("Вие сте баща на три абитуриентки,\n" +
                    "бъдете готови за стабилни\n" +
                    "разходи. Губите 100 парички.");
        }
        if (a > 65 && a < 80){
            System.out.println("Най-добрият Ви служител\n" +
                    "получава повиквателна за\n" +
                    "казармата. Губите обучен\n" +
                    "персонал и 150 парички.");
        }
        if (a > 79 && a < 95){
            System.out.println("На връщане от супермаркета,\n" +
                    "чудовище се опитва да ви изяде.\n" +
                    "Справяте се с неприятеля,\n" +
                    "използвайки карате, но се налага\n" +
                    "да пишете обяснения, които водят\n" +
                    "до пропускане на важна среща и\n" +
                    "загуба на бизнес партньор. Губите 200 парички");
        }
        if(a > 94){
            System.out.println("Част от бизнесите Ви фалират,\n" +
                    "заради задаваща се епидемия от\n" +
                    "потна треска. Губите 250 парички.");
        }
    }
    public static void GoodChance(){
        int a = Dice.RollDice(100);
        if (a < 40) {
            System.out.println("Осиновявате група\n" +
                    "сирачета, за да си вдигнете\n" +
                    "социалното реноме.\n" +
                    "Социалните мрежи са във\n" +
                    "възторг, получавате\n" +
                    "окуражителни дарения от\n" +
                    "обществото. Получвате 50 парички.");
        }
        if (a > 39 && a <66) {
            System.out.println("Хващате си младо гадже,\n" +
                    "малка котка с големи\n" +
                    "възможности. Получавате\n" +
                    "вечното уважение на\n" +
                    "кварталните пичове, както\n" +
                    "и легендарен статус на\n" +
                    "вечен играч. Печелите 100 парички.");
        }
        if (a > 65 && a < 80){
            System.out.println("Напускате университета и\n" +
                    "ставате милионер. Честито!\n" +
                    " Получавате 150 парички.");
        }
        if (a > 79 && a < 95){
            System.out.println("Тийнейджъри представят\n" +
                    "гениална идея за\n" +
                    "рационализиране на\n" +
                    "производствените\n" +
                    "мощности. Получавате\n" +
                    "стабилен бонус. Печелите 200 парички");
        }
        if(a > 94){
            System.out.println("Тийнейджъри представят\n" +
                    "гениална идея за\n" +
                    "рационализиране на\n" +
                    "производствените\n" +
                    "мощности. Получавате\n" +
                    "стабилен бонус. Печелите 250 парички.");
        }
    }
}